Данное домашнее задание посвящено схеме базе данных, связанной с футбольным командами. Схема расположена в hw_diagram.jpg
## Описание таблиц 

### Positions 
Позиции игроков
id - уникальный идентификатор позиции 
Name - Название таблицы 

### Coaches 
Таблица тренеров 
id - уникальный идентификатор тренера
Name - имя тренера 

## Teams 
Таблица команд 
id - уникальный идентификатор  команды 
Name - имя команды 
Location - расположение команды 
Coach_id - идентификатор тренера 

### Players 
Таблица игроков 
Id - уникальный идентификатор игрока 
Name - имя игрока 
Age - возраст игрока 
Position_id - идентификатор позиции 
Team_id - идентификатор команды 
Start_date - дата начала игры в команде 

### PlayersArchive 
Архив по игрокам (информация о том, в какой команде игрок играл ранее) 
player_id - идентификатор игрока 
team_id - идентификатор команды 
start_date - дата начала игры 
end_date - дата окончания игры

In [603]:
%load_ext sql
%sql sqlite:///chinook.db

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

'Connected: None@chinook.db'

# Задание 1
Реализовать перенакатываемые sql-скрипты по схеме hw_diagram, приложенного ниже.

In [604]:
%%sql
pragma foreign_keys = on;
drop table if exists PlayeesArchive;
drop table if exists Players;
drop table if exists Teams;
drop table if exists Positions;
drop table if exists Coaches;

create table Positions(
    id integer(0,0) not null,
    Name varchar,
    primary key(id)
);
create table Coaches(
    id integer(0,0) not null,
    Name varchar,
    primary key(id)
);
create table Teams(
    id integer(0,0) not null,
    Name varchar,
    Location varchar,
    Coach_id integer,
    primary key(id),
    foreign key(Coach_id) references Coaches (id)
);
create table Players(
    id integer(0,0) not null,
    Name varchar,
    Age integer not null,
    Position_id integer(0,0) not null,
    Team_id integer(0,0) not null,
    Start_date date,
    primary key(id),
    foreign key(Team_id) references Teams (id),
    foreign key(Position_id) references Positions (id)
);
create table PlayeesArchive(
    Player_id integer(0,0) not null,
    Team_id integer(0,0) not null,
    start_date date,
    end_date date,
    primary key(Player_id,Team_id),
    foreign key(Player_id) references Players (id),
    foreign key(Team_id) references Teams (id)
);

Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.

[]

# Задание 2
Написать sql-скрипт, осуществляюший добавление всех возможных позиций игроков. (В данной задаче можно ограничится четырьмя - вратарь, защитник, полузащитник, нападающий)

In [605]:
%%sql
insert into Positions(id,Name) values(1,'нап'),(2,'плз'),(3,'защ'),(4,'врт');
select* from Positions

4 rows affected.
Done.

[(1, 'нап'), (2, 'плз'), (3, 'защ'), (4, 'врт')]

# Задание 3
Написать функцию, осуществляющую добавление тренера. На вход функции подается имя тренера. При невозможности вставки функция должна обработать данное исключение и вывести пользователю информацию о проблеме

После написания функции необходимо добавить несколько тренеров для таблицы.

In [606]:
import sqlite3
db=sqlite3.connect('chinook.db')
def insert_coach(Name):
    cur = db.cursor();
    try:
        cur.execute('''select coalesce(max(id)+1,1) from Coaches''')
        id=cur.fetchone()[0]  
        cur.execute('''insert into Coaches(id, Name) values(?,?)''', (id,Name))
        db.commit()
        return id
    
    except Typeerror:
        print('Error')
        return -1

In [607]:
insert_coach('Gvardiola')
insert_coach('Mourinho')
insert_coach('Bishovec')
insert_coach('Cherchesov')
insert_coach('Kobelev')
insert_coach('Karera')
insert_coach('Semak')

7

In [608]:
%%sql
select * from Coaches

Done.

[(1, 'Gvardiola'),
 (2, 'Mourinho'),
 (3, 'Bishovec'),
 (4, 'Cherchesov'),
 (5, 'Kobelev'),
 (6, 'Karera'),
 (7, 'Semak')]

# Задание 4

Написать функцию, осуществляющую добавление команды. На вход функция принимает (имя команды, местоположение, имя тренера).
На выходе должна быть добавлена команда.

После написания функции необходимо добавить несколько команд

In [609]:

def check_coach(Coach):
    cur = db.cursor()
    cur.execute('''select id from Coaches where Name = ?''', (Coach,))
    try:
        coach_id = cur.fetchone()[0]
    
        return coach_id
    except TypeError:
        print('Error')
        return -1

In [610]:

check_coach('Gvardiola')

1

In [611]:
check_coach('Mourinho')

2

In [612]:
check_coach('jjjj')

Error

-1

In [613]:

def insert_team(Name,Location,Coach):
    cur = db.cursor();
    cur.execute('''select coalesce(max(id)+1,1) from Teams''')
    id=cur.fetchone()[0]  
    Coach_id = check_coach(Coach)
    cur.execute('''insert into Teams(id, Name,Location,Coach_id) values(?,?,?,?)''', (id,Name,Location,Coach_id))
    db.commit()

In [614]:
insert_team('Dinamo', 'Moscow', 'Kobelev')
insert_team('Spartak','Moscow','Karera')
insert_team('Ufa','Ufa','Semak')

In [615]:
%%sql
select * from Teams

Done.

[(1, 'Dinamo', 'Moscow', 5), (2, 'Spartak', 'Moscow', 6), (3, 'Ufa', 'Ufa', 7)]

# Задание 5

Написать функцию, осуществляющую обновление информации о команде. У функции на входе должен быть один обязательный параметр - название команды и два необязательных параметра - имя тренера и местоположение. При этом хотя бы один из необязательных параметров должен быть заполнен. Функция должна обновлять значение переданных необязательных параметров.

После написания функции вызовите данную функцию несколько раз

In [616]:
def upgrade_team(Name,Coach = None,location = None):
    cur = db.cursor()
    if Coach == None and location == None:
        print('Error--no team and no coach')
        return -1
    if Coach == None and location != None:
        cur.execute('''Update Teams set Location = ? where Name = ?''',(location, Name))
    if Coach and location == None:
        coach_id = check_coach(Coach)
        cur.execute('''Update Teams set Coach_id = ? where Name = ?''',(coach_id,Name))
    if Coach and location:
        coach_id = check_coach(Coach)
        cur.execute('''Update Teams set Location = ? where Name = ?''',(location,Name))
        cur.execute('''Update Teams set Coach_id = ? where Name = ?''',(coach_id,Name))
    db.commit()

In [617]:
upgrade_team('Canunnikov')

Error--no team and no coach

-1

In [618]:
%%sql
select * from Teams

Done.

[(1, 'Dinamo', 'Moscow', 5), (2, 'Spartak', 'Moscow', 6), (3, 'Ufa', 'Ufa', 7)]

In [619]:
upgrade_team('Dinamo',Coach = 'Bishovec')

In [620]:
%%sql
select * from Teams

Done.

[(1, 'Dinamo', 'Moscow', 3), (2, 'Spartak', 'Moscow', 6), (3, 'Ufa', 'Ufa', 7)]

In [621]:
%%sql
select * from Coaches

Done.

[(1, 'Gvardiola'),
 (2, 'Mourinho'),
 (3, 'Bishovec'),
 (4, 'Cherchesov'),
 (5, 'Kobelev'),
 (6, 'Karera'),
 (7, 'Semak')]

In [622]:
upgrade_team('Dinamo',location = 'Leningrad')

In [623]:
%%sql
select * from Teams

Done.

[(1, 'Dinamo', 'Leningrad', 3),
 (2, 'Spartak', 'Moscow', 6),
 (3, 'Ufa', 'Ufa', 7)]

In [624]:
upgrade_team('Dinamo',Coach = 'Kobelev',location = 'Moscow')

In [625]:
%%sql
select * from Teams

Done.

[(1, 'Dinamo', 'Moscow', 5), (2, 'Spartak', 'Moscow', 6), (3, 'Ufa', 'Ufa', 7)]

# Задание 6

Написать функцию, осуществляющую добавление нового футболиста в таблицу игроков. На входе (имя, возраст, название позиции, название команды, дата перехода в команду(необязательный параметр)). Если дата перехода не указана, то нужно использовать текущую дату. Предусмотреть различные ошибки (такие как неверное имя позиции, неверное название команды, возраст < 10 и > 50 и т.п.)

После написания функции необходимо добавить несколько игроков.

In [626]:
def add_player(name, age, position, team, date = None):
    cur = db.cursor()
    cur.execute('''select coalesce(max(id)+1,1) from Players''')
    try:
        id = cur.fetchone()[0]
        cur.execute('''select id from Positions where Name = ?''',(position,))
        position_id = cur.fetchone()[0]
        cur.execute('''select id from Teams where Name = ?''',(team,))
        team_id = cur.fetchone()[0]
        cur.execute( ''' SELECT id from positions ''');
        pos_all = cur.fetchall()
        if date == None:
            cur.execute('''select date(current_date)''')
            date = cur.fetchone()[0]
           # print(pos_all)
        if ((position_id,) in pos_all and (age < 50 and age > 10)):
            cur.execute('''insert into Players (id,Name,Age,Position_id,Team_id,Start_date) values(?,?,?,?,?,?)''',
                        (id,name, age, position_id, team_id,date))
        else:
            print('Error--')
        db.commit()
    except TypeError: 
        print('Error-')

In [627]:
add_player('Mhitaryan',28,'нап','Dinamo')
add_player('Pavluchenko',30,'нап','Spartak')
add_player('Zinchenko',22,'плз','Ufa','2015-02-15')

In [628]:
%%sql
select * from Players

Done.

[(1, 'Mhitaryan', 28, 1, 1, '2018-03-03'),
 (2, 'Pavluchenko', 30, 1, 2, '2018-03-03'),
 (3, 'Zinchenko', 22, 2, 3, '2015-02-15')]

# Задание 7
Написать функцию для перевода игрока в другую команду. Данная функция должна осуществить архивирование текущей записи в таблице игроков в таблицу players_archive с заполнение end_date - датой начала игры за новую команду - 1 день. А также осуществлять изменение поля в таблице Players. При возникновении ошибки должен осуществляться полный откат транзакции.

In [633]:

def update_players(name, new_team,date): 
    cur = db.cursor() 
    cur.execute('''select coalesce(max(Player_id)+1,1) from PlayersArchive''')
    pl_id = cur.fetchone()[0]
    cur.execute( '''SELECT DATE(?, '-1 day')''',(date,)) 
    try: 
        d=cur.fetchone()[0] 
        cur.execute( '''SELECT team_id FROM players where name=?''',(name,)) 
        t= cur.fetchone()[0] 
        cur.execute( '''SELECT id FROM players where name=?''',(name,)) 
        ID= cur.fetchone()[0] 
        cur.execute('''insert into PlayersArchive(Player_id,Team_id,start_date,end_date) values(?,?,?,?)''', (pl_id,d, ID, t,)) 
        cur.execute( '''SELECT id FROM teams where name=?''',(new_team,)) 
        tn= cur.fetchone()[0] 
        cur.execute ('''Update players set team_id = ?, start_date=? where name = ?''', (tn, date, name)) 
        cur.execute(''' 
        INSERT INTO playersarchive (player_id, team_id, start_date, end_date ) VALUES(?,?,?,?)''', (ID,tn,date,d)) 
        db.commit() 
    except TypeError: 
        print('Сос') 
        
        db.rollback()

In [634]:
update_players('Mhitaryan','Spartak','2018-12-12')

ERROR:root:An unexpected error occurred while tokenizing input
The following traceback may be corrupted or invalid
The error message is: ('EOF in multi-line string', (1, 94))

IntegrityError: UNIQUE constraint failed: PlayersArchive.Player_id, PlayersArchive.Team_id

In [631]:
%%sql
select* from Players

Done.

[(1, 'Mhitaryan', 28, 1, 2, '2018-12-12'),
 (2, 'Pavluchenko', 30, 1, 2, '2018-03-03'),
 (3, 'Zinchenko', 22, 2, 3, '2015-02-15')]

In [632]:
%%sql
select* from PlayersArchive

Done.

[(1, '2018-12-11', 1, 1), (1, 2, '2018-12-12', '')]